# ДЗ 12.1. Очистити текст від html-тегів
#Написати функцію, яка прочитає заданий файл, очистить текст від html-тегів і запише цей текст в інший файл.
#html-тег завжди починається з "<" і закінчується на ">" ,потрібно видалити ці символи та все, що між ними.
#Функція отримує на вхід два параметри – ім'я файлу, який потрібно очистити, та ім'я файлу, куди потрібно
# записати очищений текст. Ім'я файлу, куди потрібно писати, можна задати за замовчуванням.
#Приклади файлів у вкладенні – файл який потрібно очистити (draft.html) та приклад файлу,
# який може вийти на виході з очищеним текстом (cleaned.txt). Файл draft.html необхідно скачати і
# покласти поряд з файлом, де буде вирішення цієї задачі.

# для використання регулярних виразів завантажуємо бібліотеку re
import re

def cleaner_htmlteg(input, output):
    """
    Clean the text from html tags.
    input : input_file , name output_file
    output : output_file without tegs
    """
    # читаємо файл draft.html
    with open(input, "r") as file:
        text = file.read()
    # по суті, нам потрібно вивести зміст, що розміщено у тегах => шукаємо зміст, який розміщено
    # між символами > та </ за допомогою регулярного виразу
    template = r">(.*)</"
    #для пошуку використовуємо функцію findall, яка знаходить та повертає усі збіги з шаблоном
    matches = re.findall(template, text)
    # знайдене співпадіння необхідно записати у файл та розділити по рядкам (\n )
    with open(output, "w") as file:
        for match in matches:
            text = file.write(match + "\n")
# Використовуємо
cleaner_htmlteg("draft.html", "cleaned_file.txt")

