### ДЗ  2.1. Введення 4-х значного числа з клавіатури , друк у стовпчик
#          цифр, з якого складається число.

# Запит на введення цілого числа (int) з клавіатури за допомогою Input
number_4d = int(input("Enter four-digit number:"))

# отримання першої цифри 4-х значного числа
number1 = number_4d // 1000
# отримання другої цифри 4-х значного числа
number2 = number_4d % 1000 // 100
# отримання третьої цифри 4-х значного числа
number3 = number_4d % 100 // 10
# отримання четвертої цифри 4-х значного числа
number4 = number_4d % 100 % 10

# Друк кожної цифри 4-х значного числа у стовпчик (закоментовано)
# print(number1)
# print(number2)
# print(number3)
# print(number4)

# Другий варіант друку (закоментовано)
# print(number1, number2, number3, number4, sep="\n" )

# Більш оптимальний варіант друку цифр за допомогою функції формат (f)
print(f"{number1}\n{number2}\n{number3}\n{number4}\n")



### ДЗ  2.2. Необхідно "перевернути" 5-ти значне число: введення 5-ти значного числа з клавіатури ,
#          друк 5-ти значного числа, яке складається з цифр у зворотній послідовності.
#

# Запит на введення цілого числа (int) з клавіатури за допомогою Input
number_5d = int(input("Enter five-digit number:"))

# отримання першої цифри 5-ти значного числа
number1 = number_5d // 10000
# отримання другої цифри 5-ти значного числа
number2 = number_5d // 1000 % 10
# отримання третьої цифри 5-ти значного числа
number3 = number_5d // 100 % 10
# отримання четвертої цифри 5-ти значного числа
number4 = number_5d % 100 // 10
# отримання п'ятої цифри 5-ти значного числа
number5 = number_5d % 10

# отримання цифр для "перевернутого" 5-ти значного числа
number5_1 = number5 * 10000
number4_2 = number4 * 1000
number3_3 = number3 * 100
number2_4 = number2 * 10

# отримання цілого "перевернутого" числа
number = number5_1 + number4_2 + number3_3 + number2_4 + number1

# друк "перевернутого" числа за допомогою функції формат (f)
print(f"{number}\n")
# print(number1, number2, number3, number4, number5, sep="\n" )

