# ДЗ  4.1  Програма, яка переміщує всі нулі до кінця списку.
#          Порядок ненульових чисел має зберігатись.

# Список
#digits = [4, 13, 0, 5, 0, 99]
#digits = [0]
digits = [89, 5, 0, 0, 45, 12, 0, 1, 0, 87, 32]
print(digits)
# Створюємо пустий список, у який буде заноситись результуюча послідовність чисел.
digits_new = []
# Створюємо цикл переносу не нульових чисел у пустий список
# якщо цифра не нуль , то додаємо її у новий список
for d in digits:
    if d !=0:
        digits_new.append(d)
#проміжний перегляд списку без нулів (якщо не користуватись Debug режимом)
#print(digits_new)
# підрахунок 0 у списку
zero_count = digits.count(0)
# перегляд підрахунку кількості 0 (якщо не користуватись Debug режимом)
#print(zero_count)
# заносимо 0 у кінець нового списку (відповідно до підрахунку)
while zero_count != 0:
    zero_count -= 1
    digits_new.append(0)
print(digits_new)